
# go
brew 'go'

# python
brew 'python@3.10'

# ruby
brew 'rbenv'
brew 'ruby-build'
brew 'openssl@1.1'
brew 'readline'

# nodejs
brew 'node'
brew 'yarn'

# java
brew 'openjdk'

# # heroku
# tap 'heroku/brew'
# brew 'heroku/brew/heroku'

# docker / kubernetes
brew 'docker-compose'
brew 'kind'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'stern'
brew 'kustomize'
brew 'kube-ps1'

# cli tool
brew 'bat'
brew 'ripgrep'
brew 'peco'
brew 'jq'
brew 'fzf'
brew 'telnet'
brew 'fd'
brew 'hugo'
brew 'mermaid-cli'
brew 'tmux'
brew 'curl'
brew 'gnupg'

# develop tool / library
brew 'ghq'
brew 'git'
brew 'git-delta'
brew 'git-secrets'
brew 'sqlite'

